package tw.com.phctw.utils;
import java.util.ArrayList;
import java.util.Random;

public class NameGenerator {
	//134
//    private String[] last = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
//    						 "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
//    						 "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", 
//    						 "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", 
//    						 "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
//    						 "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", 
//    						 "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", 
//    						 "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", 
//    						 "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", 
//    						 "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹", 
//    						 "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", 
//    						 "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", 
//    						 "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮", 
//    						 "蓝", "闵", "席", "季"};
//    //300
//    private String[] first = {"秀", "娟", "英", "华", "慧", "巧", "美 ", "娜", "静", "淑",
//    				  		  "惠", "珠", "翠", "雅", "芝", "玉", "萍", "红", "娥", "玲",
//    				  	      "芬", "芳", "燕", "彩", "春", "菊", "兰", "凤", "洁", "梅",
//    				  	      "琳", "素", "云", "莲", "真", "环", "雪", "荣", "爱", "妹",
//    				  	      "霞", "香", "月", "莺", "媛", "艳", "瑞", "凡", "佳", "嘉",
//    				  	      "琼", "勤", "珍", "贞", "莉", "桂", "娣", "叶", "璧", "璐", 
//    				  	      "娅", "琦", "晶", "妍", "茜", "秋", "珊", "莎", "锦", "黛", 
//    				  	      "青", "倩", "婷", "姣", "婉", "娴", "瑾", "颖", "露", "瑶", 
//    				  	      "怡", "婵", "雁", "蓓", "纨", "仪", "荷", "丹", "蓉", "眉",
//    				  	      "君", "琴", "蕊", "薇", "菁", "梦", "岚", "苑", "婕", "馨",
//    				  	      "瑗", "琰", "韵", "融", "园", "艺", "咏", "卿", "聪", "澜",
//    				  	      "纯", "毓", "悦", "昭", "冰", "爽", "琬", "茗", "羽", "希",
//    				  	      "宁", "欣", "飘", "育", "滢", "馥", "筠", "柔", "竹"," 霭", 
//    				  	      "凝", "晓", "欢", "霄", "枫", "芸", "菲", "寒", "伊", "亚",
//    				  	      "宜", "可", "姬", "舒", "影", "荔", "枝", "思", "丽", "伟",
//    				  	      "刚", "勇", "毅", "俊", "峰", "强", "军", "平", "保", "东", 
//    				  	      "文", "辉", "力", "明", "永", "健", "世", "广", "志", "义", 
//    				  	      "兴", "良", "海", "山", "仁", "波", "宁", "贵", "福", "生", 
//    				  	      "龙", "元", "全", "国", "胜", "学", "祥", "才", "发", "武",
//    				  	      "新", "利", "清", "飞", "彬", "富", "顺", "信", "子", "杰",
//    				  	      "涛", "昌", "成", "康", "星", "光", "天", "达", "安", "岩", 
//    				  	      "中", "茂", "进", "林", "有", "坚", "和", "彪", "博", "诚", 
//    				  	      "先", "敬", "震", "振", "壮", "会", "思", "群", "豪", "心", 
//    				  	      "邦", "承", "乐", "绍", "功", "松", "善", "厚", "庆", "磊", 
//    				  	      "民", "友", "裕", "河", "哲", "江", "超", "浩", "亮", "政",
//    				  	      "谦", "亨", "奇", "固", "之", "轮", "翰", "朗", "伯", "宏",
//    				  	      "言", "若", "鸣", "朋", "斌", "梁", "栋", "维", "启", "克",
//    				  	      "伦", "翔", "旭", "鹏", "泽", "晨", "辰", "士", "以", "建",
//    				  	      "家", "致", "树", "炎", "德", "行", "时", "泰", "盛", "雄",
//    				  	      "琛", "钧", "冠", "策", "腾", "楠", "榕", "风", "航", "弘"};
	
    
	private String last = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏"
			 	 		+ "陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳"
			 	 		+ "酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余"
			 	 		+ "元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞"
			 	 		+ "熊纪舒屈项祝董梁杜阮蓝闵席季";
	
	private String first = "秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊"
						 + "兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤"
						 + "珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖"
						 + "露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融"
						 + "园艺咏卿聪澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹霭"
						 + "凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽伟刚勇毅俊峰强"
						 + "军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元"
						 + "全国胜学祥才发武新利清飞彬富顺信子杰涛昌成康星光天达"
						 + "安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承乐绍"
						 + "功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏"
						 + "言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行"
						 + "时泰盛雄琛钧冠策腾楠榕风航弘";
	
    public NameGenerator() {
    }
    
    public String getName() {
    	String name = "";
    	Random rand = new Random();
    	
    	int num = rand.nextInt(134);
    	name += last.substring(num,num+1);
    	num = rand.nextInt(300);
    	name += first.substring(num,num+1);
    	num = rand.nextInt(300);
    	name += first.substring(num,num+1);
    	
    	return name;
    }
}
